it/src/InformationRegisters/МестонахождениеОС/МестонахождениеОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестонахождениеОС</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещение</types>
    </type>
  </resources>
  <resources>
    <name>ОСВладелец</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ИмяДомена</name>
    <type>
      <types>CatalogRef.ИдентификаторыДоменов</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/InformationRegisters/АналогиЛицензий/АналогиЛицензий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналогиЛицензий</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторПрограммы</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналог</name>
    <type>
      <types>CatalogRef.ИдентификаторыПрограмм</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/InformationRegisters/ИсключаемыеПриЗагрузке/ИсключаемыеПриЗагрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсключаемыеПриЗагрузке</name>
  <resources>
    <name>Исключить</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторКомпьютера</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/InformationRegisters/ОтключенныеКомпьютеры/ОтключенныеКомпьютеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтключенныеКомпьютеры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторКомпьютера</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

it/src/CommonModules/УправлениеОсновнымиСредствамиСервер/Module.bsl
//Проверка местонаходжения
//
Процедура СуществованиеДвиженийМестонахождениеОС(ИмяТабличнойЧасти, СтруктураШапкиДокумента, Отказ, Заголовок, ОбектПроверки,Ф_Есть=Ложь) Экспорт
	
	ТаблицаПроверки = СтруктураШапкиДокумента.Ссылка[ИмяТабличнойЧасти].Выгрузить();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	МестонахождениеОССрезПоследних.ОсновноеСредство
	               |ИЗ
	               |	РегистрСведений.МестонахождениеОС.СрезПоследних(&Период, ОсновноеСредство В (&СпОсновноеСредство)) КАК МестонахождениеОССрезПоследних";
	
	Запрос.УстановитьПараметр("Период",?(ОбектПроверки.ЭтоНовый(),ТекущаяДата(),Новый Граница(ОбектПроверки.МоментВремени(), ВидГраницы.Исключая)));
	Запрос.УстановитьПараметр("СпОсновноеСредство",ТаблицаПроверки.ВыгрузитьКолонку("ОсновноеСредство"));
	ТЗ_Проверки = Запрос.Выполнить().Выгрузить();
	Если Ф_Есть Тогда
		Для Каждого Стр_Н_ОС Из ТЗ_Проверки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Присутствует первоначальное местонахождение основного средства: " + СокрЛП(Стр_Н_ОС.ОсновноеСредство.Наименование) + ", инв. номер УУ: " + Стр_Н_ОС.ОсновноеСредство.ИнвентарныйНомерУУ, Отказ, Заголовок);
		КонецЦикла;
	Иначе
		Для Каждого Стр_Проверки Из ТаблицаПроверки Цикл
			Если ТЗ_Проверки.Найти(Стр_Проверки.ОсновноеСредство,"ОсновноеСредство") = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Отсутствует первоначальное местонахождение основного средства: " + СокрЛП(Стр_Проверки.ОсновноеСредство.Наименование) + ", инв. номер УУ: " + Стр_Проверки.ОсновноеСредство.ИнвентарныйНомерУУ, Отказ, Заголовок);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры // 

//Проверка местонаходжения
//
Процедура ПроверитьМестонахождениеОС(ТаблицаПроверки, СтруктураШапкиДокумента, Отказ, Заголовок, ОбектПроверки) Экспорт
	
	Нм = 1;
	ТекстВремТаб = "ВЫБРАТЬ ";
	Для Каждого СтрКол_Таб Из ТаблицаПроверки.Колонки Цикл
		Если СтрКол_Таб.Имя = "НомерСтроки" Тогда
		Иначе
			Если Нм = ТаблицаПроверки.Колонки.Количество() Тогда
				ТекстВремТаб = ТекстВремТаб + СтрКол_Таб.Имя;
			Иначе
				ТекстВремТаб = ТекстВремТаб + СтрКол_Таб.Имя + ", ";
			КонецЕсли;
		КонецЕсли;
		Нм = Нм + 1;
	КонецЦикла;
	ТекстВремТаб = ТекстВремТаб + " ПОМЕСТИТЬ ТЗ_ДанныхСписок ИЗ &ТЗ_Данных КАК ТЗ_Данных";
	
	Запрос = Новый Запрос(ТекстВремТаб);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТЗ_Данных",ТаблицаПроверки);
	Запрос.Выполнить();
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ_ДанныхСписок.ОсновноеСредство,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВложенныйЗапрос.ОсновноеСредство, """") = """"
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПризнакНесовпадения
	               |ИЗ
	               |	ТЗ_ДанныхСписок КАК ТЗ_ДанныхСписок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МестонахождениеОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	               |			МестонахождениеОССрезПоследних.МОЛ КАК МОЛ,
	               |			МестонахождениеОССрезПоследних.Организация КАК Организация,
	               |			МестонахождениеОССрезПоследних.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	               |			МестонахождениеОССрезПоследних.Помещение КАК Помещение,
	               |			МестонахождениеОССрезПоследних.ОСВладелец КАК ОСВладелец
	               |		ИЗ
	               |			РегистрСведений.МестонахождениеОС.СрезПоследних(&Период, ) КАК МестонахождениеОССрезПоследних) КАК ВложенныйЗапрос
	               |		ПО ТЗ_ДанныхСписок.ОсновноеСредство = ВложенныйЗапрос.ОсновноеСредство";
	
	Для Каждого СтрКол_Таб Из ТаблицаПроверки.Колонки Цикл
		Если СтрКол_Таб.Имя = "НомерСтроки" или СтрКол_Таб.Имя = "ОсновноеСредство" Тогда
		Иначе
			Запрос.Текст = Запрос.Текст + "
			| И ТЗ_ДанныхСписок." + СтрКол_Таб.Имя + " = ВложенныйЗапрос." + СтрКол_Таб.Имя;
		КонецЕсли;
	КонецЦикла;
				   
	Запрос.УстановитьПараметр("Период",?(ОбектПроверки.ЭтоНовый(),ТекущаяДата(),Новый Граница(ОбектПроверки.МоментВремени(), ВидГраницы.Исключая)));
	ТЗ_Проверки = Запрос.Выполнить().Выгрузить();

	ОтборОС = Новый Структура();
	ОтборОС.Вставить("ПризнакНесовпадения",Истина);
	
	НайденыеОС = ТЗ_Проверки.НайтиСтроки(ОтборОС);
	Для Каждого Стр_Н_ОС Из НайденыеОС Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Расхождение в первоначальном местонахождение основного средства: " + СокрЛП(Стр_Н_ОС.ОсновноеСредство.Наименование) + ", инв. номер УУ: " + Стр_Н_ОС.ОсновноеСредство.ИнвентарныйНомерУУ, Отказ, Заголовок);
	КонецЦикла;
	
КонецПроцедуры // 


//Функция возвращает аналоги программ
Функция ВернутьАналогиИдентификатораНаСервере(ИдентификаторПрограммы) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИдентификаторПрограммы");
	
	Если ЗначениеЗаполнено(ИдентификаторПрограммы) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	АналогиЛицензий.Аналог КАК ИдентификаторПрограммы
		               |ИЗ
		               |	РегистрСведений.АналогиЛицензий КАК АналогиЛицензий
		               |ГДЕ
		               |	АналогиЛицензий.ИдентификаторПрограммы = &ИдентификаторПрограммы
		               |	И НЕ АналогиЛицензий.Аналог ЕСТЬ NULL ";
					   
		Запрос.УстановитьПараметр("ИдентификаторПрограммы", ИдентификаторПрограммы);
		
		Результат = Запрос.Выполнить().Выгрузить()
		
	КонецЕсли;	
	
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.ИдентификаторПрограммы = ИдентификаторПрограммы;
	
	//Получили полную таблицу аналогов
	МассивАналогов = Результат.ВыгрузитьКолонку("ИдентификаторПрограммы");
	
	СписокАналогов = Новый СписокЗначений;
	СписокАналогов.ЗагрузитьЗначения(МассивАналогов);
	
	Возврат СписокАналогов;
	
КонецФункции //ВернутьАналогиИдентификатораНаСервере	

Функция ВернутьИдентификаторыАналогаНаСервере(ИдентификаторПрограммы) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ИдентификаторПрограммы");
	
	Если ЗначениеЗаполнено(ИдентификаторПрограммы) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	АналогиЛицензий.ИдентификаторПрограммы
		               |ИЗ
		               |	РегистрСведений.АналогиЛицензий КАК АналогиЛицензий
		               |ГДЕ
		               |	АналогиЛицензий.Аналог = &ИдентификаторПрограммы
		               |	И НЕ АналогиЛицензий.ИдентификаторПрограммы ЕСТЬ NULL ";
					   
		Запрос.УстановитьПараметр("ИдентификаторПрограммы", ИдентификаторПрограммы);
		
		Результат = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;	
	
	НоваяСтрока = Результат.Добавить();
	НоваяСтрока.ИдентификаторПрограммы = ИдентификаторПрограммы;
	
	//Получили полную таблицу аналогов
	МассивАналогов = Результат.ВыгрузитьКолонку("ИдентификаторПрограммы");
	
	СписокАналогов = Новый СписокЗначений;
	СписокАналогов.ЗагрузитьЗначения(МассивАналогов);

	Возврат СписокАналогов;
	
КонецФункции //ВернутьИдентификаторыАналогаНаСервере	

Функция ИсключатьПриЗагрузке(ИдентификаторКомпьютера) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИсключаемыеПриЗагрузке.Исключить
	               |ИЗ
	               |	РегистрСведений.ИсключаемыеПриЗагрузке КАК ИсключаемыеПриЗагрузке
	               |ГДЕ
	               |	ИсключаемыеПриЗагрузке.ИдентификаторКомпьютера = &ИдентификаторКомпьютера";
				   
	Запрос.УстановитьПараметр("ИдентификаторКомпьютера", ИдентификаторКомпьютера);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка.Исключить;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ИсключатьПослеСписания(ИдентификаторКомпьютера)	Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтключенныеКомпьютерыСрезПоследних.Отключен
	               |ИЗ
	               |	РегистрСведений.ОтключенныеКомпьютеры.СрезПоследних(, ) КАК ОтключенныеКомпьютерыСрезПоследних
	               |ГДЕ
	               |	ОтключенныеКомпьютерыСрезПоследних.ИдентификаторКомпьютера = &ИдентификаторКомпьютера";
				   
	Запрос.УстановитьПараметр("ИдентификаторКомпьютера", ИдентификаторКомпьютера);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка.Отключен;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции // ИсключатьПослеСписания()
